JulianYG/WNR/nRF5_comp_spi/examples/peripheral/comp_spi_freertos/main.c
/* Copyright (c) 2014 Nordic Semiconductor. All Rights Reserved.
 *
 * The information contained herein is property of Nordic Semiconductor ASA.
 * Terms and conditions of usage are described in detail in NORDIC
 * SEMICONDUCTOR STANDARD SOFTWARE LICENSE AGREEMENT.
 *
 * Licensees are granted free, non-transferable use of the information. NO
 * WARRANTY of ANY KIND is provided. This heading must NOT be removed from
 * the file.
 *
 */

/** @file
* @defgroup spi_master_example_main main.c
* @{
* @ingroup spi_master_example
*
* @brief SPI Master Loopback Example Application main file.
*
* This file contains the source code for a sample application using SPI.
*
*/

#include <stdlib.h>
#include <string.h>

#include "nrf_delay.h"
#include "app_error.h"
#include "app_util_platform.h"
#include "app_uart.h"
#include "nrf_drv_spi.h"
#include "bsp.h"
//#include "app_timer.h"
#include "nordic_common.h"
#include "nrf.h"
#include "micro_esb.h"
#include "uesb_error_codes.h"
#include "heatshrink_encoder.h"
#include "heatshrink_decoder.h"
#include "heatshrink_config.h"

#include "FreeRTOS.h"
#include "task.h"
#include "timers.h"
#include "nrf_drv_clock.h"
#include "nrf_soc.h"

#include "nrf_drv_gpiote.h"

/********************************** DATA ACQUISITION DEFINITIONS ************************************************/

#define APP_TIMER_PRESCALER      0                      ///< Value of the RTC1 PRESCALER register.
//#define APP_TIMER_MAX_TIMERS     BSP_APP_TIMERS_NUMBER  ///< Maximum number of simultaneously created timers.
#define APP_TIMER_OP_QUEUE_SIZE  2                      ///< Size of timer operation queues.
#define SAMPLE_DELAY APP_TIMER_TICKS(1, APP_TIMER_PRESCALER) // Sample rate in MS
#define NUM_CHANNELS 16                                         // Number of channels to sample from

#define DELAY_MS                 1000 /*1000*/                   ///< Timer Delay in milli-seconds.

//ADC setup
int ADC_bias = 32; // <= 120 kS/s
int MUX_bias = 40; // <= 120 kS/s
int ADC_twoscomp = 0x40; // no weakMISO, twoscomp, no absmode, no DSP
//high cutoff
int RH1_DAC1 = 30;  //reg 8
int RH1_DAC2 = 5;   // reg 9
int RH2_DAC1 = 43;  //reg  10
int RH2_DAC2 = 6;   //reg 11
//low cutoff
int RL_DAC1 = 16;   //reg  12
int RL_DAC2 = 60;   //reg 13
int RL_DAC3 = 1;    //reg 13 - bit 6
/** @def  TX_RX_MSG_LENGTH
 * number of bytes to transmit and receive. This amount of bytes will also be tested to see that
 * the received bytes from slave are the same as the transmitted bytes from the master */
#define TX_MSG_LENGTH         2  // 16-bits command words
#define RX_MSG_LENGTH 		  2  // 16-bits echo

#define UART_TX_BUF_SIZE 256                         /**< UART TX buffer size. */
#define UART_RX_BUF_SIZE 256                           /**< UART RX buffer size. */

typedef enum
{
    TEST_STATE_SPI0_LSB,    ///< Test SPI0, bits order LSB
    TEST_STATE_SPI0_MSB,    ///< Test SPI0, bits order MSB
    END_OF_TEST_SEQUENCE
} spi_master_ex_state_t;

typedef enum{
	CALIBRATE,
	CLEAR,
	WRITE,
	READ,
	CONVERT,
	DUMMY
} intan_function;

static intan_function m_intan_function = DUMMY; //initialize state for DUMMY


static uint8_t m_tx_data_spi[TX_MSG_LENGTH]; ///< SPI master TX buffer.
static uint8_t m_rx_data_spi[RX_MSG_LENGTH]; ///< SPI master RX buffer.

static volatile bool m_transfer_completed = true;
static spi_master_ex_state_t m_spi_master_ex_state = (spi_master_ex_state_t)0;

static const nrf_drv_spi_t m_spi_master_0 = NRF_DRV_SPI_INSTANCE(0);
static int intan_convert_channel = 0;          // Channel on Intan currently converting.
//static uint32_t counter = 0;
/********************************** COMPRESSION DEFINITIONS ************************************************/

#define NUM_DATA_BUFFERS 2                                                     /**<Number of data buffers to use> */
#define DATA_BUF_SIZE 	(2048U)                                                /**<buffer size for each data buffer.> */
#define TRANSMISSION_BUF_SIZE 	(DATA_BUF_SIZE + (DATA_BUF_SIZE/2) + 4)          /**<buffer size for the transmission buffer.> */
#define COMP_DELAY 1                                        /** <Delay compression by 1 ms each time> */


static uint8_t *transmission_buffer;                                           /**<Buffer for storing and sending the compressed data>*/
static uint8_t *data_buffers[NUM_DATA_BUFFERS];                                /**<Buffers for storing data>*/
static bool buffers_ready[NUM_DATA_BUFFERS];                                   /**<At each index, stores whether or not the buffer is full of raw data>*/
static uint8_t active_buffer = 0;                                              /**<Buffer index that is currently storing incoming data>*/
static uint8_t comp_index = 0;                                                 /**<Buffer index that will be filled and compressed next>*/
static uint16_t ab_capacity = DATA_BUF_SIZE;                                   /**<How much more space is left in the active buffer>*/

//static bool compression_in_progress = false;                                   /**<Flag for whether or not is in progress>*/

static heatshrink_encoder hse;

static uesb_payload_t tx_payload, rx_payload;			// uesb init payloads

//APP_TIMER_DEF(comp_timer);    // Timer for running compression asynchronously
/********************************** DATA ACQUISITION PROTOTYPE ************************************************/

static void intan_dummy(uint8_t * const p_tx_buf,
                     uint8_t * const p_rx_buf);
static void intan_calibrate(uint8_t * const p_tx_buf,
                     uint8_t * const p_rx_buf);
static void intan_clear(uint8_t * const p_tx_buf,
                     uint8_t * const p_rx_buf);
static void intan_write(uint8_t * const p_tx_buf,
                     uint8_t * const p_rx_buf,
                     int R, //register
                     int D); //data
static void intan_read(uint8_t * const p_tx_buf,
                     uint8_t * const p_rx_buf,
                     int R); //register
static void intan_convert(uint8_t * const p_tx_buf,
                     uint8_t * const p_rx_buf,
                     int C); //channel
void app_error_handler_main(uint32_t error_code, uint32_t line_num, const uint8_t * p_file_name);
void uart_error_handle(app_uart_evt_t * p_event);
void spi_master_0_event_handler(nrf_drv_spi_evt_type_t* event);
//void *spi_master_0_event_handler_implementation(nrf_drv_spi_evt_type_t* event);
static void spi_master_init(nrf_drv_spi_t const * p_instance, bool lsb);
static void spi_send_recv(nrf_drv_spi_t const * p_instance,
                          uint8_t * p_tx_data,
                          uint8_t * p_rx_data,
                          uint16_t  tx_len,
                          uint16_t  rx_len);

