JulianYG/WNR/nRF5_comp_spi/examples/peripheral/comp_spi_freertos/main.c
//APP_TIMER_DEF(spi_timer);        // For data acquisition

static void switch_state(void);
void bsp_configuration(void);
void intan_setup(void);
void timers_init(void);
void data_collection_timers_start(void);
void sample_data(void);

int send_data(uint8_t *data, int length);


/********************************** COMPRESSION PROTOTYPE ************************************************/
void compression_init(void);
void compress(uint32_t buf, uint32_t size);



/********************************** DATA ACQUISITION FUNCTIONS ************************************************/

/** The following driver functions do the following:
* populate tx_buffer
* clear rx_buffer
* set relevant m_intan_function enum 
*/
static void intan_dummy(uint8_t * const p_tx_buf,
                     uint8_t * const p_rx_buf)
{
	p_tx_buf[0] = 0x00; //set 0x0000 to transmit
	p_tx_buf[1] = 0x00;
	p_rx_buf[0] = 0x00; // clear rx buffer
	p_rx_buf[1] = 0x00;	

	m_intan_function = DUMMY; // set function to be dummy

}

static void intan_calibrate(uint8_t * const p_tx_buf,
                     uint8_t * const p_rx_buf)
{
	p_tx_buf[0] = 0x00; //set 0x5500 to transmit
	p_tx_buf[1] = 0x00;
	p_rx_buf[0] = 0x00; // clear rx buffer
	p_rx_buf[1] = 0x00;	
	
	m_intan_function = CALIBRATE; // set function to be dummy

}
static void intan_clear(uint8_t * const p_tx_buf,
                     uint8_t * const p_rx_buf)
{
	p_tx_buf[0] = 0x6A; //set 0x6A00 to transmit
	p_tx_buf[1] = 0x00;
	p_rx_buf[0] = 0x00; // clear rx buffer
	p_rx_buf[1] = 0x00;	
	
	m_intan_function = CLEAR; // set function to be dummy

}
static void intan_write(uint8_t * const p_tx_buf,
                     uint8_t * const p_rx_buf,
                     int R, //register
                     int D) //data
{
	int message = 0x8000 | (R<<8 | D);
	p_tx_buf[0] = message >> 8; //set 0x0000 to transmit
	p_tx_buf[1] = message & 0xFF;
	p_rx_buf[0] = 0x00; // clear rx buffer
	p_rx_buf[1] = 0x00;	
	
	m_intan_function = WRITE; // set function to be dummy

}
static void intan_read(uint8_t * const p_tx_buf,
                     uint8_t * const p_rx_buf,
                     int R) //register
{
	int message = 0xC000 | (R<<8);
	p_tx_buf[0] = message >> 8; //set 0x0000 to transmit
	p_tx_buf[1] = message & 0xFF;
	p_rx_buf[0] = 0x00; // clear rx buffer
	p_rx_buf[1] = 0x00;	
	
	m_intan_function = READ; // set function to be dummy
}

static void intan_convert(uint8_t * const p_tx_buf,
                     uint8_t * const p_rx_buf,
                     int C) //channel
{
	int message = (C<<8);
	p_tx_buf[0] = message >> 8; //set 0x0000 to transmit
	p_tx_buf[1] = message & 0xFF;
	p_rx_buf[0] = 0x00; // clear rx buffer
	p_rx_buf[1] = 0x00;	
	
	m_intan_function = CONVERT; // set function to be dummy
}

void uart_error_handle(app_uart_evt_t * p_event)
{
    if (p_event->evt_type == APP_UART_COMMUNICATION_ERROR)
    {
        APP_ERROR_HANDLER(p_event->data.error_communication);
    }
    else if (p_event->evt_type == APP_UART_FIFO_ERROR)
    {
        APP_ERROR_HANDLER(p_event->data.error_code);
    }
}

/**@brief Function for error handling, which is called when an error has occurred. 
 *
 * @param[in] error_code  Error code supplied to the handler.
 * @param[in] line_num    Line number where the handler is called.
 * @param[in] p_file_name Pointer to the file name. 
 */
void app_error_handler_main(uint32_t error_code, uint32_t line_num, const uint8_t * p_file_name)
{
    //UNUSED_VARIABLE(bsp_indication_set(BSP_INDICATE_FATAL_ERROR));

    for (;;)
    {
        // No implementation needed.
    }
}


/**@brief Handler for SPI0 master events.
 *
 * @param[in] event SPI master event.
 */
void spi_master_0_event_handler(nrf_drv_spi_evt_type_t* event)
{
    uint32_t err_code = NRF_SUCCESS;
	  //uint32_t c_buff;   // Temporarily store the buffer index of the buffer ready to be compressed

    switch (*event)
    {
			  //while(app_uart_put(73) != NRF_SUCCESS);
			  // Transfer complete; store in buffer.
        case NRF_DRV_SPI_EVENT_DONE:
					
            nrf_drv_spi_uninit(&m_spi_master_0);
				
				    // Transfer done after this point
						m_transfer_completed = true;
				
				    //printf("Data received\r\n");
				    //while(app_uart_put(69) != NRF_SUCCESS);
				    //printf("%d\r\n", ++counter);

            //err_code = bsp_indication_set(BSP_INDICATE_RCV_OK);
            //APP_ERROR_CHECK(err_code);*/
				
				    // All buffers are in use; The just acquired data will be lost.
				    if(buffers_ready[active_buffer])
						{
							while(app_uart_put(70) != NRF_SUCCESS);
							//while(app_uart_put(70) != NRF_SUCCESS);
							//printf("All buffers in use. Data lost\r\n");
						}
						
						// Still have space to store data.
						else
						{
							// Current buffer still has space
							if(ab_capacity > 0)
							{
								*(data_buffers[active_buffer] + DATA_BUF_SIZE - ab_capacity) = m_rx_data_spi[0];
								
								// Buffer is filled after this storage.  Set the next buffer as active.  Call compression, if compression is not in progress.
								if(--ab_capacity == 0)
								{
									buffers_ready[active_buffer] = true;
									ab_capacity = DATA_BUF_SIZE;
									if(active_buffer == NUM_DATA_BUFFERS - 1)
									{
										active_buffer = 0;
									}
									
									else
									{
										active_buffer++;
									}
									
									// Compress
									//if(!compression_in_progress)
									//{
										//printf("Compressing\r\n");
										//while(app_uart_put(73) != NRF_SUCCESS);
										//compression_in_progress = true;
										//err_code = app_timer_start(comp_timer, 5, &c_buff);
										//while(app_uart_put(74) != NRF_SUCCESS);
										//printf("%d\r\n", err_code);
										//while(1);
										//APP_ERROR_CHECK(err_code);
										//while(app_uart_put(75) != NRF_SUCCESS);
										//compress(c_buff, DATA_BUF_SIZE);
										//printf("Compress is done\r\n");
										//while(app_uart_put(71) != NRF_SUCCESS);
									//}
								}
							}
						}
						
						// If not all channels have been sampled, continue sampling from the other channels.
						if(intan_convert_channel == NUM_CHANNELS)
						{
							intan_convert_channel = 0;
						}
						else
						{
							sample_data();
						}
            break;

        default:
            // No implementation needed.
            break;
    }
}

/**@brief Handler for SPI0 company Intan read events.
 *
 * @param[in] event SPI master event.
 */
void spi_intan_id_read_handler(nrf_drv_spi_evt_type_t* event)
{
    uint32_t err_code = NRF_SUCCESS;
	  //uint32_t c_buff;   // Temporarily store the buffer index of the buffer ready to be compressed

    switch (*event)
    {
			  //while(app_uart_put(73) != NRF_SUCCESS);
			  // Transfer complete; store in buffer.
        case NRF_DRV_SPI_EVENT_DONE:
					
            nrf_drv_spi_uninit(&m_spi_master_0);
				
