JulianYG/WNR/nRF5_comp_spi/examples/peripheral/comp_spi_freertos/main.c
    }
}

/********************************** COMPRESSION FUNCTIONS ************************************************/

int ASSERTC(COND){
  if (!(COND)) return -1;
}

int ASSERT_EQ(COND1,COND2){
  if (COND1 != COND2) return -1;
}

/** Initialize compression variables, buffers, etc.*/
void compression_init(void)
{
	transmission_buffer = malloc(TRANSMISSION_BUF_SIZE);
	if(transmission_buffer == NULL)
	{
		//while(app_uart_put(66) != NRF_SUCCESS);
		printf("Transmission buffer Alloc failed\r\n");
	}
	
	memset(transmission_buffer, 0, TRANSMISSION_BUF_SIZE);
	for(int i = 0; i < NUM_DATA_BUFFERS; i++)
	{
		data_buffers[i] = malloc(DATA_BUF_SIZE);
		
		if(data_buffers[i] == NULL)
		{
			//while(app_uart_put(67) != NRF_SUCCESS);
			printf("Data buffer %d Alloc failed\r\n", i);
		}

		memset(data_buffers[i], 0, DATA_BUF_SIZE);
		buffers_ready[i] = false;
	}
}

void compress(uint32_t buf, uint32_t size)
{
	  size_t count = 0;
    uint32_t sunk = 0;
    uint32_t polled = 0;
	
	  // Compression in progress.
	  //compression_in_progress = true;
	
	  //printf("Buf %d compression start...\r\n", buf);
	  // Clear encoder state machine
	  heatshrink_encoder_reset(&hse);
	
    while (sunk < size) {
        ASSERTC(heatshrink_encoder_sink(&hse, &(data_buffers[buf][sunk]), size - sunk, &count) >= 0);
        sunk += count;
        if (sunk == size) {
            ASSERT_EQ(HSER_FINISH_MORE, heatshrink_encoder_finish(&hse));
        }

        HSE_poll_res pres;
        do {                    /* "turn the crank" */
            pres = heatshrink_encoder_poll(&hse, &transmission_buffer[polled], TRANSMISSION_BUF_SIZE - polled, &count);
            ASSERTC(pres >= 0);
            polled += count;
        } while (pres == HSER_POLL_MORE);
        ASSERT_EQ(HSER_POLL_EMPTY, pres);
        if (polled >= TRANSMISSION_BUF_SIZE) {
					printf("compression should never expand that muchr\r\n"); 
				}
        if (sunk == size) {
            ASSERT_EQ(HSER_FINISH_DONE, heatshrink_encoder_finish(&hse));
        }
    }
		
	// Finished compression.
	buffers_ready[buf] = false;
	printf("Buf %d compression done\r\n", buf);
		
	send_data(transmission_buffer, polled);
		
}

int send_data(uint8_t *data, int length)
{
	for (int i = 0; i < length; ++i) {
		tx_payload.data[i % 8] = data[i];
		if (i > 0 && i % 8 == 0)
			uesb_write_tx_payload(&tx_payload);
	}
}

void sample_data(void)
{
	if(m_transfer_completed)
	{
		//if(intan_convert_channel < NUM_CHANNELS) {
		//	printf("%d\r\n", intan_convert_channel);
		//}
		m_transfer_completed = false;
		intan_convert(m_tx_data_spi, m_rx_data_spi,intan_convert_channel);
		intan_convert_channel++;
         
		switch_state();
	}
	
	// Previous transfer still in progress. Data lost
	else
	{
		while(app_uart_put(69) != NRF_SUCCESS);
	}
}

// Every time the spi timer expires, we begin data collection one channel at a time
static void spi_data_collection_evt_handler(void *pvParameter)
{ 
	//static int intan_convert_channel = 0;
	//if (m_transfer_completed)
  //{
	//while(app_uart_put(72) != NRF_SUCCESS);
	//m_transfer_completed = false;
  //}
	//while(app_uart_put(71) != NRF_SUCCESS);
	UNUSED_PARAMETER(pvParameter);
	//nrf_drv_gpiote_out_toggle(20);
	
	//printf("Ready to sample\r\n");
	sample_data();
	//while(app_uart_put(72) != NRF_SUCCESS);
}

// For testing; read out intan id
static void spi_intan_id_handler(void *pvParameter)
{
	static int company_title = 0;
	UNUSED_PARAMETER(pvParameter);
	if(m_transfer_completed)
	{
		//if(intan_convert_channel < NUM_CHANNELS) {
		//	printf("%d\r\n", intan_convert_channel);
		//}
		m_transfer_completed = false;
		intan_read(m_tx_data_spi, m_rx_data_spi,company_title + 40);
		company_title++;
		company_title = company_title % 5;
         
		switch_state();
	}
	
	// Previous transfer still in progress. Data lost
	else
	{
		while(app_uart_put(69) != NRF_SUCCESS);
	}
}

static void compress_task (void *pvParameter)
{
	// Continue to check if there is something to compress
	UNUSED_PARAMETER(pvParameter);
	for(;;)
	{
		
		//while(app_uart_put(70) != NRF_SUCCESS);
		//printf("compress task\r\n");
		if(buffers_ready[comp_index])
		{
			printf("cready\r\n");
			compress(comp_index++, DATA_BUF_SIZE);
			comp_index = comp_index % NUM_DATA_BUFFERS;
		}
		//vTaskDelay(COMP_DELAY);
	}
}
/*
void compression_evt_handler(void *p_context)
{
	uint32_t err_code;
	while(app_uart_put(74) != NRF_SUCCESS);
	compress(*((uint32_t *) p_context), DATA_BUF_SIZE);
	err_code = app_timer_stop(comp_timer);
	while(app_uart_put(75) != NRF_SUCCESS);
	APP_ERROR_CHECK(err_code);
}

void timers_init(void)
{
	uint32_t err_code;
	
	//APP_TIMER_INIT(APP_TIMER_PRESCALER, APP_TIMER_OP_QUEUE_SIZE, false);
	err_code = app_timer_create(&spi_timer, APP_TIMER_MODE_REPEATED, spi_data_collection_evt_handler);
	APP_ERROR_CHECK(err_code);
	
	err_code = app_timer_create(&comp_timer, APP_TIMER_MODE_SINGLE_SHOT, compression_evt_handler);
	APP_ERROR_CHECK(err_code);
	//printf("%d", SAMPLE_DELAY);
	//printf("%d\n", err_code);
}

void data_collection_timers_start(void)
{
	uint32_t err_code;
	err_code = app_timer_start(spi_timer, SAMPLE_DELAY, NULL);
	//printf("%d\n", SAMPLE_DELAY);
	APP_ERROR_CHECK(err_code);
}*/

/**@brief Function for placing the application in low power state while waiting for events.
 */
/*static void power_manage(void)
{
    uint32_t err_code = sd_app_evt_wait();
    APP_ERROR_CHECK(err_code);
}*/

static void test_callback (void *pvParameter)
{
    static uint32_t counter = 0;
	  if(!(++counter%1000)) {
			printf("counter: %d\r\n", counter);
		}
}

static uesb_event_handler_t uesb_event_handler()
{
	static uint32_t rf_interrupts;
	static uint32_t tx_attempts;
	
	uesb_get_clear_interrupts(&rf_interrupts);
	
	if (rf_interrupts & UESB_INT_TX_SUCCESS_MSK) {}
	
	if (rf_interrupts & UESB_INT_TX_FAILED_MSK) {
		uesb_flush_tx();
	}
	
	if (rf_interrupts & UESB_INT_RX_DR_MSK) {
		uesb_read_rx_payload(&rx_payload);
		NRF_GPIO->OUTCLR = 0xFUL << 8;
		NRF_GPIO->OUTSET = (uint32_t)((rx_payload.data[2] & 0x0F) << 8);
	}
	uesb_get_tx_attempts(&tx_attempts);
	NRF_GPIO->OUTCLR = 0xFUL << 12;
	NRF_GPIO->OUTSET = (tx_attempts & 0x0F) << 12;
}


/** @brief Function for main application entry.
 */
int main(void)
{
	  TaskHandle_t  compress_task_handle;
	  TimerHandle_t spi_timer_handle;
	
	
	  uint32_t err_code;
	
	  err_code = nrf_drv_clock_init();
    APP_ERROR_CHECK(err_code);
	
    // Setup bsp module.
    //bsp_configuration();

    //uart initialization
    const app_uart_comm_params_t comm_params =
      {
          RX_PIN_NUMBER,
          TX_PIN_NUMBER,
          RTS_PIN_NUMBER,
          CTS_PIN_NUMBER,
          APP_UART_FLOW_CONTROL_ENABLED,
          false,
          UART_BAUDRATE_BAUDRATE_Baud38400
      };

    APP_UART_FIFO_INIT(&comm_params,
                         UART_RX_BUF_SIZE,
                         UART_TX_BUF_SIZE,
                         uart_error_handle,
                         APP_IRQ_PRIORITY_LOW,
                         err_code);

    APP_ERROR_CHECK(err_code);
			
